hagen-poiseuille_axis/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    limitedGrad     cellLimited Gauss linear 1;
}
  
divSchemes
{
    default         none;
 
    div(phi,U)      Gauss linearUpwind limited;
    div(phi,e)      Gauss linearUpwind limited;
    div(phi,K)      Gauss linear;
    div(phi,(p|rho))    Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}
  
laplacianSchemes
{
    default        Gauss linear corrected;
}
  
interpolationSchemes
{
    default         linear;
}
  
snGradSchemes
{
    default         corrected;
}



// ************************************************************************* //
